/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50723
Source Host           : localhost:3306
Source Database       : tourist

Target Server Type    : MYSQL
Target Server Version : 50723
File Encoding         : 65001

Date: 2019-03-12 16:38:24
*/

SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for discuss
-- ----------------------------
DROP TABLE IF EXISTS `discuss`;
CREATE TABLE `discuss`
(
  `id`      int(100)     NOT NULL AUTO_INCREMENT,
  `type`    int(5)       NOT NULL,
  `pid`     int(100)     NOT NULL,
  `uid`     int(100)     NOT NULL,
  `ptime`   datetime     NOT NULL,
  `present` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 50
  DEFAULT CHARSET = utf8;

-- ----------------------------
-- Records of discuss
-- ----------------------------
INSERT INTO `discuss`
VALUES ('49', '2', '31', '19', '2019-02-12 00:00:00',
        '本次旅行中的意外惊喜，毫不夸张！ 民宿就在曲江池公园和大唐芙蓉园的连接处，往哪边走都是抬脚就到。出门就是曲江池，晒太阳消磨时间简直不要太爽！ 服务非常到位！一到民宿就有工作人员接待，帮拿行李。遇到任何一位工作人员都是面带微笑，亲切有礼！有什么要求店长会马上从隔壁的院子过来处理，都不会让客人动脚去隔壁！ 房间装饰有品位，设施也有档次，晚上会送酸奶，早餐是定餐制，味道不错，看着没几样，但还是能吃饱！ 总的来说，感觉价格虽不便宜，但绝对物有所值。');

-- ----------------------------
-- Table structure for news
-- ----------------------------
DROP TABLE IF EXISTS `news`;
CREATE TABLE `news`
(
  `nid`      int(10)     NOT NULL AUTO_INCREMENT,
  `ntitle`   varchar(20) NOT NULL,
  `stime`    datetime    NOT NULL,
  `summary`  text        NOT NULL,
  `present`  varchar(20) NOT NULL,
  `quarry`   varchar(20) NOT NULL,
  `newphoto` varchar(20) NOT NULL,
  PRIMARY KEY (`nid`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 17
  DEFAULT CHARSET = utf8;

-- ----------------------------
-- Records of news
-- ----------------------------
INSERT INTO `news`
VALUES ('12', '十大精品民宿之栗居', '2016-05-10 08:55:21',
        '这个地方就是栗居民宿栗居民宿位于陕西省西安市泾河新城沣泾大道正阳大道什字西北角寿平民宿小镇内，地理环境非常优越，距西安市区仅约30公里，自驾不过一小时车程临近乐华城欢乐世界、乐华88度温泉、崇文塔、茯茶小镇等景区景点，民宿的特色也是十分鲜明，有耕种区、小动物区、儿童游乐区、自助烧烤区、蔬菜采摘区等。栗子，有着坚硬的外壳，可是内心却包含着柔软芳香的果实。栗居就是承载了这样一个理念，不同的需求的游客来到这里，将找到一间属于自己心仪的温暖小屋。栗居名字的含义：栗，联系着静默山水，田园风光。居，享受田径舒适的慢生活，有安逸，有生活。使人一下子回归田园生活，怡然自得。一排小别墅傲气的伫立在那儿，不卑不亢，不慌不忙。走进独栋别墅，干净明亮的实木家具展现在眼前，前后庭院非常的宽敞幽静，约上三五好友举杯畅谈，亦或是几家人围炉夜话，那滋味一定甚是美好~▲亲子家庭乐园亲子独栋的内置，也是两层别墅，一进门便开始浮想联翩，房间的色彩搭配很是温馨，明亮的田园小清新风格显得格外活泼清爽。卧室提供儿童玩具，儿童滑梯，儿童帐篷，也是一个适合多个家庭亲子游的不二之选。注意啦，独栋家庭的亲子房型也是有的哦，高峰期一定要提前预定，否则会满房哒~▲围栏下圈养着可爱的小动物听这里的工作人员介绍，只要是来栗居民宿入住的客人，可以享受种菜，喂养小动物等一系列丰富的亲身体验，民宿还会不定期举办亲子活动，脱掉平日的西装革履，换上散发着清香的舒适运动衣，挽起裤角衣袖，当一个默默的小农，不奢求劈柴喂马，周游世界…当然家里有小朋友的更是不用说，在实践中成长，那意义更是不言而喻的~▲粮园里，田地间，无不充满了幸福满足的味道再回到中式客房，也是非常的美丽整洁，超大的前后庭院，宽敞明亮的客厅，优美的环境，给人一种宁静舒适的感觉，大气的样子也很是喜欢呢~试想在一个阳光明媚的上午，透过纱窗，深吸一口气，阳光的味道洒进来，这种感觉真好！！▲中式客房地址：陕西省西安市泾河新城沣泾大道正阳大道什字西北角寿平民宿小镇内周边景区推荐：乐华欢乐世界、乐华88°温泉、茯茶小镇、崇文塔、汉阳陵博物馆、国家大地原点、吴家大院咨询电话：029-36583333',
        'qidong', '西安网', 'qidong');
INSERT INTO `news`
VALUES ('13', '遇见西安最美民宿', '2016-05-03 09:14:51',
        '日前，根据多家OTA发布的2018“五一”出游趋势预测显示，过半数的用户选择拼假出游，国内将涌现一批“黑马”目的地。其中，西安就位列客源地榜单TOP15。从出游方式看，半自助游、定制游等更多个性化出游方式日益受到游客青睐。根据途家大数据显示：相较于刚过去的清明节，今年“五一”假期，民宿订单量增长了两倍多。\r\n印象南湖民宿完整保留了关中民居古朴的建筑风格，以明式建筑风为主，独具东方神韵。每间客房都有独特的设计理念，也有属于“她们”自己的名字。入住其中，不仅可以体会西安传统文化与民俗风情，还可以感受到一种清新雅致的古唐文化与精彩分呈的物质文明的碰撞，一种千年皇城与现代都市缤纷的交汇。\r\n寿平民宿小镇包括果园、汽车旅馆酒吧、畜园、菜园等组成部分，还有广场景观区、餐饮配套区、景观湖等多种旅游体验区域。乡村民宿居住区，是由星空帐篷、民宿小院，亲子田园主题、时尚工业风主题、禅茶主题、中式主题等客房构成。客房都配有现代化的生活设施，游客在这里能够尽享老村落的古朴和优美的田园风光。\r\n栗居是优美的寿平民宿小镇中住宿项目的主要部分，由20栋民宿小院、50多间（套）形式各样的客房构成，可接待成人儿童160多人。客房装修风格各异，有亲子田园、禅茶、简约时尚、中式等多个主题。晒晒太阳喝喝茶，在古老的村落和优美的田园风光中尽享生活的安逸。\r\n到秦岭山里消磨时光，身处于崖八里的院子中，时间是静止的，心灵是空明的。在这里，会忘却世间的一切喧嚣、烦乱和各种忙乱......\r\n崖.八里民宿是一众复古民宿中的意外：土砖和旧瓦自然融合，简约的三层楼，每一层都有不尽相同的细节，墙上的铁皮机车、复古海报、掉了漆的怀旧汽车牌，日式陶瓷盘……都告诉你，这里其实很时尚很现代。\r\n转身，窗外的竹林是最优美的背景，一杯上等的意大利illy咖啡，一盘五星级大厨的特制西点，你可以暂时放下不必要的“我执”，读书、发呆，坐在户外木椅上且听风吟，把时光交付给咖啡豆磨出的慵懒，和你愿意去做的任何事。\r\n慢生活是一种意境，只有懂得欣赏和享受生活的美妙的人，才能充分领略生命的从容和美好。古人通常喜欢小桥流水，花前月下，喜欢举杯邀明月，喜欢采菊东篱下。大美林庄，是对这种慢生活最好的诠释。\r\n大美林庄主体建筑由木质木屋构成、设计独特，内含住宿、标准间、套房、独立木屋可供选择，住宿环境温馨舒适，客房经过专业团队打造，可以体验到林间的慢生活。这里有美景、瀑布、喷泉，还有茂密的树林、漫天的鸟语花香，庄园到处生机勃勃，是孩子们的乐园，也是每个人聚会休闲的绝佳之地。\r\n“得山水清气，享玉舍安怡”。山水玉舍院落装修别致，看得见水，望得见山，是一个有着禅意清雅的桃花源。这里四周群山环绕，山幽谷深，溪水沿房而过，莺莺鸟语萦绕耳畔。古朴幽静、如入仙境，房舍周围务花种菜，栽果养禽。推窗而望，便可享受这山水田园风光。身处这般境地，不由让人呤起：繁华尽处，寻一处无人山谷，建一木制小屋，铺一青石小路，与你晨钟暮鼓，安之若素。\r\n客栈打破了西安千篇一律的旅宿格局，精致的院落、时尚的城墙客舍，兼具古典与时尚的美感。在粗犷的西北风情中勾勒出优雅的情调，如一阵清冽的风刺激了感官，改写你旅途中关于旅宿的记忆。\r\n青灰色的砖墙与滋水县城浑然一体，复古的建筑与外围的场景巧妙融和。灵动的空间格局，把整座客栈自然分出三个院落，布局周密，各有特色。复古雅致的室内装修风格与清新干净的大自然相映成趣，水乳交融。王府的宁静，像是一曲从前慢，营造出一段独特闲逸的旧时光。在这里，你可以独坐庭院中，执一本书、品一盏茶，静静聆听内心的声音，也可携友二三，品美酒、尝美食、览美景，快意人生。\r\n上王院子拥有10间客房，是以中式与现代时尚相融合。来这里，你可以品尝到丰盛的关中美食，选备的食材都是绿色无公害农产品，每一道可口的饭菜都是主人亲力亲为，就为让每一位客人感受到家一般的温馨。住上一晚，更能感受到关中人的朴实和淳朴。清晨的一缕青烟，可以让你闻到浓浓的乡土味。清晨的阳光透过格子窗，很唯美…\r\n这里地处骊山之巅，人祖庙旁。四季分明，春有蜂舞，夏有树凉，秋见雨雾，冬历雪霜。屋子是在老房子的基础上改造的，保留了原有的古朴风格，用旧木青石打造的客房散发出独有的清幽气息。这里远离城嚣，是静心休闲的好去处。酒品美食样样俱全，民俗特色一个不少，颇具秦风陕韵。\r\n穷庐坐落于骊山碧波荡漾的林海深处，整栋庭院三面环山，视野开阔。向外，是远山叠翠，郁郁葱葱；向内，是青砖泥墙，古香古色，推开门，就可以享受不受打扰的惬意山居生活。夜幕降临，蛙鸣声起，没有了此起彼伏的喇叭声，便可以好好倾听自己内心的声音。没有了雾霾，有的只是一阵阵凉风吹来的清爽和惬意。\r\n榴花溪堂取自于余右任的一首诗“榴花有情尊来客，溪堂无声纳古今”。客栈属于关中四合院，是一个两进两出的老宅，以中国传统建筑风格融合陕西关中民宅四合院为设计理念。整个院落以山院、水院为中轴线对称布局，充分体现“仁者乐山，智者乐水”的主题。\r\n海蒂民宿庄园，海蒂庄园是以瑞士童话作品《海蒂》为灵感，打造的一个集充满童趣、具有异域风情的庄园。这里结合关中地区清幽的环境、淳朴的民风、厚重的文化资源而建，不仅拥有餐饮、休闲、手工制作等特色文化，还有四季分明的主题活动。\r\n在这里，可以远离城市的喧嚣生活，回归大自然的怀抱，和大自然融为一起，享受大自然的安静与祥和。夜晚徜徉在五彩灯光的装扮下，更像是漫步在梦幻童话乐园中，让沉寂已久的纯真从尘嚣烦扰中惊醒。\r\n楼观道温泉酒店紧邻楼观台国家森林公园，森林覆盖率和郁闭度、负氧离子含量都高。楼观道温泉酒店秉承楼观道家思想，每一物、每一景，都充分彰显“道”的栖居智慧。巧夺天工的建筑设计与竹林环绕、幽静秀美的楼观台遥相呼应，装饰独具匠心，配套设施齐全，人性化服务细致入微，充份体现建筑与环境，产品与服务，人与自然的高度和谐统一。\r\n道温泉酒店最新推出以\\\"自然楼观·康养天地\\\"为品牌特色的系列养生新品。在这里可以观竹海·品茶道·泡温泉。这里有18属150种竹子，1550公顷翠竹成为楼观台国家森林公园一道亮丽的风景线，是中国北方最大的观赏竹林基地。茶道被誉为是道家的化身，在这里，可以通过沏茶、赏茶、闻茶、饮茶、美心修德，学习礼法，领略传统美德。酒店更有17座园林式生态露天汤池，53℃的出水温度，每天720立方出水量，含HCO2化学性质PH值为7.90的中性水，水中含有多种矿物质和微量元素，以健康养生、修身养性的中国传统道家养生理念为基础，为顾客提供最体贴的中国式精品服务。\r\n皇城豪门酒店位于西安市中心地带古城墙内最繁华的商业区，集购物、娱乐以及各种当地特色餐厅、名产店于一体，毗邻市内各旅游景点，步行到钟楼和碑林仅需10分钟。距西安咸阳国际机场和西安火车站仅40分钟和5分钟的路程，交通十分便捷。',
        'tubu', '西安网', 'tubu');
INSERT INTO `news`
VALUES ('14', '十大精品民宿之白鹿原王府', '2016-03-16 16:56:39',
        '院落自古就和中国人的生活息息相关，除了生活空间，这更是情感寄托地、与自然的栖息相融地。但曾经风韵十足的老院子，都在时代变迁中或面目全非、或逐渐淹没。在西安城里，也难再住进一方庭院，体会砖头瓦块间的丝丝记忆。如今在距西安不远的白鹿原上，却有了个能住进去的“王府”。身在其中，能细细回味起白鹿原上风云激荡的历史，更能体会到一份属于院落的闲适静谧。\r\n白鹿原王府·城墙精品客栈位于国家级AAAA级景区白鹿原景区核心区域滋水县城中心地段，2018年被评为“西安市十佳民宿”。客栈打破了西安千篇一律的旅宿格局，精致的院落、时尚的城墙客舍，兼具古典与时尚的美感。在粗狂的西北风情中勾勒出优雅的情调，如一阵清冽的风刺激了感官，改写你旅途中关于旅宿的记忆，成就了西安最有情怀的客栈。\r\n好的民宿，自身就是一道风景，所在地理位置更是能让你能体会到目的地的特色，甚至因为他们身处景区当中，能够欣赏到美轮美奂的节目表演，能够品尝到最为地道的当地美食，短短几步路就能一览整个景区，少了舟车劳顿之苦。\r\n具有关中特色的建筑风格，保留着四合院的传统规制。带有浓郁老陕风格的装饰材料，强调着质朴、原生态的中国北方民居格调。无论是还原的古老地砖，还是墙壁上使用的草席，都在创新中述说着古老的故事。\r\n因为白鹿原独特的文化氛围，整个院落都仿佛存在于电影之中，一树一景一物，也都在诉说着这里发生的故事。坐在太师椅上饮茶静思不正是想寻找的另一种生活方式。\r\n在自己的庭院，找回真实的自己。在不远处，城墙悄然矗立在王府的旁边，似是在守护着这份安宁，依着城墙根而设计的酒店客房，精致而独特。\r\n高速路线：\r\n1、西安绕城高速—沪陕高速（蓝田方向）—蓝关出口—关中环线（向西8.7公里）—白鹿原影视城\r\n2、西安绕城高速—包茂高速（安康、柞水方向）—太乙宫出口—关中环线（向东31公里）—白鹿原影视城\r\n低速路线：\r\n1、东郊：东三环—马鸣路—新韦鸣路—安哑路—候白路—关中环线—白鹿原影视城\r\n2、南郊：南三环—马鸣路—新韦鸣路—安哑路—候白路—关中环线—白鹿原影视城\r\n3、西郊：西三环—丈八西路—博士路—西部大道—子午大道—关中环线—白鹿原影视城\r\n4、北郊：北三环—东三环—马鸣路—新韦鸣路—安哑路—候白路—关中环线—白鹿原影视城',
        'hutong', '人民铁道网', 'hutong');
INSERT INTO `news`
VALUES ('15', '十大精品民宿之穷庐', '2016-05-16 19:44:20',
        '穷”的含义有两层：一，减少、没有；二，无穷无尽。“庐”就是破房子的意思。由此可见，店老板对客栈的起名也是别出心裁，骊山之上，举目远眺，“最美盘山路”绵延十数里，让风景秀美的骊山更加妖娆。\r\n穷庐，就地处这骊山人祖庙旁的仁宗乡芋坡村，四周绿树掩映，视野开阔，民风淳朴，秦风陕韵。\r\n刚进门，这种天然淳朴的民俗风气立即展现在眼前，极具关中风情的房屋简朴而贴心，传统的庭院里，建筑、器物错落有致，瞬间就让人产生了非常亲切的感觉。午后一只慵懒的猫，乖乖的眼神让人忍不住想要摸摸它。这里的一草一木，一人一物，都让这里充满了乡土风情、充满了远离尘嚣的生活气息。\r\n整个院落分为前院（餐厅和天台茶室）和后院（廬友住宿区域）、朴宿（待建的老年短租度假公寓区域）、东院（三孔窑洞的独立院子）、拙园（竹林休闲区域）五个区域（正在装修）。\r\n院落眼前的房屋便是餐厅，约五十个餐位，最大接待人数可达到七十人，提供墉廬老酒和自家腊味以及简单的乡村饭食及各类面食。\r\n前院的右侧是天台茶室，楼顶自然风光无限好，可看到远处的山峦叠嶂，隐约的小村庄，深呼一口气，瞬间感觉一切烦恼瞬间全无，什么都不重要了，同时看书，瑜伽，打太极…也是非常的适合。\r\n楼顶观景天台可容纳三十人，是喝茶及休闲活动的最佳场所，闲暇之余，约上俩三好友，煮酒沏茶，琴棋书画，有偷得浮生半日闲的意境，如此甚好！\r\n穿过厅堂便到了后院也就是住宿区，一排排整齐朴素的民风建设，令人卸下疲惫，回归田园生活。屋顶的建筑风格也是十分古朴雅致。房间内的设计主要以禅修为主题，传统古旧家具，图中的床铺为关中大炕。\r\n去穷庐小住一晚吧，这里的山路美不胜收，这里的人们热情朴实，这里环境优美，空气清新，使人回归大自然，忘却烦恼！\r\n工作人员告诉我们，穷庐的服务人员全部是从当地的贫困户、剩余劳动力当中招收，对整个芋坡村的脱贫及经济发展起到了非常良好的推动作用。穷庐在去年的试营业当中，累计接待庐友近万人次，想要去体验的小伙伴们，一定要提前在各大民宿平台上预约，否则可能会满房哦！\r\n一个骊山上的家，\r\n早晨的薄雾远山，\r\n午后的清风仙榻，\r\n可以是酒，可以是茶，\r\n可以是书，可以是画，\r\n可以呆坐冥想，\r\n可以相邀月下，\r\n可以识我辨他，\r\n可以心了无挂…\r\n莫负时间，莫负年华，\r\n这片连绵山野，\r\n便是苍天之下，\r\n那些浮云渺事，\r\n不抵沧海一砂……\r\n煮酒，沏茶，\r\n只把这人间，\r\n处处生莲花',
        'zhaosheng', '中国陕西网', 'zhaosheng');
INSERT INTO `news`
VALUES ('16', '十大精品民宿之大美林庄', '2018-07-21 00:00:00',
        '大美林庄，也正是源起于这样一个梦想\r\n大美林庄-林间属于西安市长安区王曲街道辖区，现在的林间曾是七十年代的农场。农业社解散后，因沙河水患，洪水冲击，遗为荒地十几年。民宿主人的祖父早年一直看护农场，不忍心土地荒废，后由其父亲出面将这片荒地承包改造，种植树木才有了今天这片树林。林间也是在原来农场看护房基础上改造修建而成。\r\n随着城市的迅速发展，人们在物质生活富裕的情况下，追求的更是精神上的回归与轻松，传统的农家乐已经根本满足不了都市人的需求。田园风格的林间民宿在这样的情况下应运而生，坚持服务小众，以小众带动大众的核心理念来发展，提醒人们不忘乡村故里的情怀，在现代生活中还能够体验到心中的那个不变的田园梦。\r\n在施工过程中，林间民宿也多方学习参考，请教他人，全程自行设计。在材料上进行废物利用，在环境上尽量不破坏自然风貌。保护树林里的野鸡野兔，让小动物在院子里随意跑动。呈现出自然和谐的状态，让客人住的舒心。\r\n目前林庄拥有八间风格各异的客房，二十多处标准露营场地。拥有丰富变化的用餐环境，可供八十余人同时就餐，可以满足家庭休闲、朋友聚会、商务用餐及团队接待。\r\n另有多功能厅一座，拥有投影音响等设备及共享书屋，可举办小型商业会议，多类主题沙龙如瑜伽、茶艺、插花及亲子活动。\r\n在饮食上也是就地取材，保持食材的新鲜，让客人能够品尝到林间精心制作的道道美食。\r\n自去年营业以来，林间受到了很多顾客的肯定。大量的来客，直接带动了周边农业产品的销售及发展。给当地草莓，蔬菜，西瓜等种植户及土鸡养殖户的销售带来了巨大的推动力。让城里人直接品尝到了优质的农副产品，让村里人增加了经济收入。最大的好处是提高了村民的服务意识和审美能力，增强了追求美好生活的信心。\r\n但在这家民宿的主人看来，林间离真正的民宿还有距离，还需要继续提高服务质量及提升基础设施，增加特色客房。另外舒适的环境还需要有文化的支撑，林间来源于农村，发展与农村，带动农村。\r\n林间地处于文学巨匠柳青笔下创业史中的蛤蟆滩，所以更要发挥优势努力打造文化名片，将柳青作品精神着重对外展示。让老人们重忆当年，让年轻者学以及用，在林间又见初心继续前行，让人们享受到快乐工作，简单生活的思想理念。',
        'youting', '中国新闻网', 'youting');

-- ----------------------------
-- Table structure for operator
-- ----------------------------
DROP TABLE IF EXISTS `operator`;
CREATE TABLE `operator`
(
  `opid`   int(10)     NOT NULL AUTO_INCREMENT,
  `opname` varchar(20) NOT NULL,
  `oppwd`  varchar(15) NOT NULL,
  PRIMARY KEY (`opid`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 2
  DEFAULT CHARSET = utf8;

-- ----------------------------
-- Records of operator
-- ----------------------------
INSERT INTO `operator`
VALUES ('1', 'admin', '123123');

-- ----------------------------
-- Table structure for question
-- ----------------------------
DROP TABLE IF EXISTS `question`;
CREATE TABLE `question`
(
  `qid`     int(10)      NOT NULL AUTO_INCREMENT,
  `uid`     int(10)      NOT NULL,
  `qtime`   datetime     NOT NULL,
  `present` varchar(150) NOT NULL,
  `state`   varchar(10)  NOT NULL,
  `qtitle`  varchar(20)  NOT NULL,
  PRIMARY KEY (`qid`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 9
  DEFAULT CHARSET = utf8;

-- ----------------------------
-- Records of question
-- ----------------------------
INSERT INTO `question`
VALUES ('2', '15', '2018-07-30 00:00:00', '西安宾馆有哪几家？价格如何？', '未解决', '西安宾馆');
INSERT INTO `question`
VALUES ('3', '15', '2018-07-30 00:00:00', '西安最好玩的景点是哪个？', '未解决', '西安景点');
INSERT INTO `question`
VALUES ('4', '16', '2018-07-30 00:00:00', '西安自驾游怎么玩？', '未解决', '自驾游');
INSERT INTO `question`
VALUES ('5', '17', '2018-07-30 00:00:00', '西安翠华山好不好玩？', '未解决', '翠华山');
INSERT INTO `question`
VALUES ('6', '17', '2018-07-30 00:00:00', '今年的旅游节日期具体是哪一天？', '未解决', '旅游节日期');
INSERT INTO `question`
VALUES ('7', '17', '2018-07-30 00:00:00', '#西安大自然度假村#我想订5室2厅，早餐双份是只能2个人吗？', '未解决', '西安大自然度假村');
INSERT INTO `question`
VALUES ('8', '17', '2018-07-30 00:00:00', '请推荐西安好玩的地方 谢谢 除了陕西历史博物馆 钟楼  还有哪里特别有趣的？', '未解决', '西安景点');

-- ----------------------------
-- Table structure for travels
-- ----------------------------
DROP TABLE IF EXISTS `travels`;
CREATE TABLE `travels`
(
  `tid`          int(100)    NOT NULL AUTO_INCREMENT,
  `uid`          int(10)     NOT NULL,
  `title`        varchar(20) NOT NULL,
  `atime`        datetime    NOT NULL,
  `present`      varchar(20) NOT NULL,
  `travelsphoto` varchar(20) NOT NULL,
  `state`        varchar(10) NOT NULL,
  PRIMARY KEY (`tid`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 9
  DEFAULT CHARSET = utf8;

-- ----------------------------
-- Records of travels
-- ----------------------------
INSERT INTO `travels`
VALUES ('4', '16', '韩城古城', '2018-07-25 00:00:00', 'meili', 'meili', '已通过');
INSERT INTO `travels`
VALUES ('5', '16', '党家村', '2018-07-25 00:00:00', 'weinisi', 'weinisi', '已通过');
INSERT INTO `travels`
VALUES ('6', '17', '凤凰镇', '2018-07-25 00:00:00', 'jinqiu', 'jinqiu', '已通过');
INSERT INTO `travels`
VALUES ('7', '17', '凤凰古镇', '2018-07-25 00:00:00', 'haohe', 'haohe', '已通过');
INSERT INTO `travels`
VALUES ('8', '17', '诸葛古镇', '2018-07-25 00:00:00', 'hai', 'hai', '未审核');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`
(
  `userid`   int(10)     NOT NULL AUTO_INCREMENT,
  `email`    varchar(30) NOT NULL,
  `userpwd`  varchar(18) NOT NULL,
  `resume`   varchar(200) DEFAULT NULL,
  `nickname` varchar(20) NOT NULL,
  `faceimg`  varchar(20)  DEFAULT NULL,
  `sex`      varchar(5)   DEFAULT NULL,
  `hobby`    varchar(20)  DEFAULT NULL,
  PRIMARY KEY (`userid`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 22
  DEFAULT CHARSET = utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user`
VALUES ('15', '634466327@qq.com', '123123', '约不约', 'user1', '3.png', '男', '篮球');
INSERT INTO `user`
VALUES ('16', '666666@qq.com', '123123', '哈哈哈哈哈', 'user2', '2.png', '男', '旅游');
INSERT INTO `user`
VALUES ('17', '555555@qq.com', '123123', '不约', 'user3', '1.png', '男', '女');
INSERT INTO `user`
VALUES ('18', '88888888@qq.com', '123123', null, 'å»æ»1', null, null, null);
INSERT INTO `user`
VALUES ('19', '1', '1', null, '4543', null, null, null);
INSERT INTO `user`
VALUES ('20', 'test@test.com', 'test', null, 'test', null, null, null);
INSERT INTO `user`
VALUES ('21', 'test1@test.com', 'test', null, 'test', null, null, null);

-- ----------------------------
-- Table structure for view_spot
-- ----------------------------
DROP TABLE IF EXISTS `view_spot`;
CREATE TABLE `view_spot`
(
  `vid`       int(20)     NOT NULL AUTO_INCREMENT,
  `vname`     varchar(20) NOT NULL,
  `present`   varchar(20) NOT NULL,
  `veiwphoto` varchar(20) NOT NULL,
  PRIMARY KEY (`vid`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 36
  DEFAULT CHARSET = utf8
  ROW_FORMAT = COMPACT;

-- ----------------------------
-- Records of view_spot
-- ----------------------------
INSERT INTO `view_spot`
VALUES ('31', '印象南湖名宿', 'yxnhms', 'yxnhms');
INSERT INTO `view_spot`
VALUES ('32', '旅游正当时，美景在蓝桥', 'lq', 'lq');
INSERT INTO `view_spot`
VALUES ('33', '走近环山旅游第一村——户县李家岩村', 'ljyc', 'ljyc');
INSERT INTO `view_spot`
VALUES ('34', '陕西关中民俗村行摄之旅 ', 'yjc', 'yjc');
INSERT INTO `view_spot`
VALUES ('35', '梦回大唐，穿越长安', 'xzm', 'xzm');
